DataProcessors/РаботаСЖурналомРегистрации.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<DataProcessor>
		<Properties>
			<Name>РаботаСЖурналомРегистрации</Name>
		</Properties>
	</DataProcessor>
</MetaDataObject>

Documents/ПоступлениеТоваров.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Document>
		<Properties>
			<Name>ПоступлениеТоваров</Name>
			<BasedOn>
				<xr:Item>Document.ЗаказПоставщику</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.ИтогиПоДокументам</xr:Item>
				<xr:Item>AccumulationRegister.Закупки</xr:Item>
				<xr:Item>AccumulationRegister.ОстаткиТоваров</xr:Item>
				<xr:Item>InformationRegister.ЦеныПоступления</xr:Item>
				<xr:Item>AccumulationRegister.ОстаткиНаСкладе</xr:Item>
				<xr:Item>AccountingRegister.РегистрУправленческий</xr:Item>
				<xr:Item>AccountingRegister.Хозяйственный</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Поставщик</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Заказ</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаказПоставщику</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Договор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Договора</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаДокумента</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТорговаяТочка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТоровыеТочки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организация</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Мастер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Товары</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Характеристика</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>13</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЦенаПоступления</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Стоимость</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Пояснение</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>250</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

DataProcessors/РаботаСЖурналомРегистрации/Forms/Форма/Ext/Form/Module.bsl
&НаСервереБезКонтекста
Процедура ИспользованиеЖурналаНаСервере()
	ТекУровень = ПолучитьИспользованиеЖурналаРегистрации();
	//НовыйУровень = Новый Массив;
	// УстановитьИспользованиеЖурналаРегистрации(НовыйУровень);
	НовыйУровень = Новый Массив;
	НовыйУровень.Добавить(УровеньЖурналаРегистрации.Ошибка);
	УстановитьИспользованиеЖурналаРегистрации(НовыйУровень);
	
КонецПроцедуры

&НаКлиенте
Процедура ИспользованиеЖурнала(Команда)
	ИспользованиеЖурналаНаСервере();
КонецПроцедуры

&НаСервере
Процедура ВыгрузитьЖурналНаСервере()
	ТаблицаЖурнала = Новый ТаблицаЗначений;
	СписокОтбора = Новый Структура;
		//СписокОтбора = Новый Структура;
	Если ЗначениеЗаполнено(ПериодЖурнала) Тогда
		СписокОтбора.Вставить("ДатаНачала",ПериодЖурнала.ДатаНачала);
		СписокОтбора.Вставить("ДатаОкончания",ПериодЖурнала.ДатаОкончания );
	КонецЕсли; 
	Если ЗначениеЗаполнено(СокрЛП(СобытиеДляОтбора)) Тогда
		СписокОтбора.Вставить("Событие",СокрЛП(СобытиеДляОтбора) );
	КонецЕсли; 	
	
	ТаблицаЗначений = Новый ТаблицаЗначений;
	Если  СписокОтбора.Количество() = 0 Тогда
		
		ВыгрузитьЖурналРегистрации (ТаблицаЗначений);
		
	Иначе
		ВыгрузитьЖурналРегистрации (ТаблицаЗначений,СписокОтбора);
		
	КонецЕсли; 
	Журнал.Загрузить(ТаблицаЗначений);	
	
КонецПроцедуры

&НаКлиенте
Процедура ВыгрузитьЖурнал(Команда)
	//очень важный
	ВыгрузитьЖурналНаСервере();
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьАвтораДокументаНаСервере(ТекДок)
	ТаблицаЖурнала = Новый ТаблицаЗначений;
	Фильтр = Новый Структура("Данные,Событие",ТекДок,"_$Data$_.New" );
	ВыгрузитьЖурналРегистрации(ТаблицаЖурнала,Фильтр);
	Если ТаблицаЖурнала.Количество()>0 Тогда
		Автор =ТаблицаЖурнала[0].ИмяПользователя;
		
	Иначе	
		Автор=Неопределено;
	КонецЕсли; 
	ТаблицаЖурнала = Новый ТаблицаЗначений;
	Фильтр = Новый Структура("Событие","_$Data$_.New" );
	ВыгрузитьЖурналРегистрации(ТаблицаЖурнала,Фильтр);
	Если ТаблицаЖурнала.Количество()>0 Тогда
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПоступлениеТоваров.Ссылка КАК Ссылка
		|ИЗ
		|	Документ.ПоступлениеТоваров КАК ПоступлениеТоваров";
		
		РезультатЗапроса = Запрос.Выполнить();
		
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			СтрокаТаблицы = ТаблицаЖурнала.Найти(ВыборкаДетальныеЗаписи.Ссылка,"Данные");
			Если СтрокаТаблицы<>Неопределено Тогда
				
				Автор =СтрокаТаблицы.ИмяПользователя;
				ТекОбъект = ВыборкаДетальныеЗаписи.Ссылка.ПолучитьОбъект();
				ТекОбъект.Автор = ВернутьПользователя(Автор);
				ТекОбъект.Записать();		   
			КонецЕсли; 
		КонецЦикла;
		
		
	Иначе	
		Автор=Неопределено;
	КонецЕсли; 
	Возврат Автор;
КонецФункции

&НаКлиенте
Процедура ПолучитьАвтораДокумента(Команда)
	Сообщить(ПолучитьАвтораДокументаНаСервере(ПоступлениеТоваровИУслуг));
КонецПроцедуры

&НаКлиенте
Процедура ПериодЖурналаПриИзменении(Элемент)
	ВыгрузитьЖурналНаСервере() ;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция СобытиеДляОтбораНачалоВыбораНаСервере(ТекЖурнал)
	ТекТаблица =ТекЖурнал.Выгрузить(); 
	ТекТаблица.Свернуть("Событие","");
	ТекТаблица.Сортировать("Событие");
	СписокДляВыбора = Новый СписокЗначений;
	Для каждого СтрокаТаблицы Из ТекТаблица Цикл
		СписокДляВыбора.Добавить(СтрокаТаблицы.Событие);
	КонецЦикла; 
	Возврат СписокДляВыбора;
КонецФункции


&НаКлиенте
Процедура СобытиеДляОтбораНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	Если Журнал.Количество()=0 Тогда
		
	Иначе
		ТекТаблицаДляПередачиНаСервер = Журнал;
		ДанныеВыбора = 	СобытиеДляОтбораНачалоВыбораНаСервере(ТекТаблицаДляПередачиНаСервер);
		СтандартнаяОбработка = Ложь;
		
	КонецЕсли; 	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ВернутьПользователя(ИмяПользователя)
	ТекПользователь = Неопределено;
		
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Пользователи.Ссылка
	|ИЗ
	|	Справочник.Пользователи КАК Пользователи
	|ГДЕ
	|	Пользователи.Код = &Код";
	
	Запрос.УстановитьПараметр("Код", ИмяПользователя);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		ТекПользователь = ВыборкаДетальныеЗаписи.Ссылка;
	КонецЦикла;
	
		
	
	Возврат ТекПользователь;
	
	
КонецФункции // ВернутьПользователя()
